{
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-RECORDID",
    "2": "B-KYCNUMBER",
    "3": "B-NAME",
    "4": "I-NAME",
    "5": "B-GUARDIANNAME",
    "6": "I-GUARDIANNAME",
    "7": "B-GENDER",
    "8": "I-GENDER",
    "9": "B-MARITALSTATUS",
    "10": "I-MARITALSTATUS",
    "11": "B-DOB",
    "12": "I-DOB",
    "13": "B-ADDRESS",
    "14": "I-ADDRESS",
    "15": "B-LANDMARK",
    "16": "I-LANDMARK",
    "17": "B-CITY",
    "18": "I-CITY",
    "19": "B-ZIP",
    "20": "I-ZIP",
    "21": "B-CITYOFBIRTH",
    "22": "I-CITYOFBIRTH",
    "23": "B-NATIONALITY",
    "24": "I-NATIONALITY",
    "25": "B-PHOTOATTACHMENT",
    "26": "I-PHOTOATTACHMENT",
    "27": "B-RESIDENTIALSTATUS",
    "28": "I-RESIDENTIALSTATUS",
    "29": "B-OCCUPATION",
    "30": "I-OCCUPATION",
    "31": "B-ACCOUNTTYPE",
    "32": "I-ACCOUNTTYPE",
    "33": "B-ANNUALINCOME",
    "34": "I-ANNUALINCOME",
    "35": "B-RELATEDPERSONNAME",
    "36": "I-RELATEDPERSONNAME",
    "37": "B-RELATION",
    "38": "I-RELATION",
    "39": "B-RELATEDPERSONADDRESS",
    "40": "I-RELATEDPERSONADDRESS",
    "41": "B-ANYPOLICY",
    "42": "B-PASSPORT",
    "43": "B-PASSPORTDATE",
    "44": "I-PASSPORTDATE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNTTYPE": 31,
    "B-ADDRESS": 13,
    "B-ANNUALINCOME": 33,
    "B-ANYPOLICY": 41,
    "B-CITY": 17,
    "B-CITYOFBIRTH": 21,
    "B-DOB": 11,
    "B-GENDER": 7,
    "B-GUARDIANNAME": 5,
    "B-KYCNUMBER": 2,
    "B-LANDMARK": 15,
    "B-MARITALSTATUS": 9,
    "B-NAME": 3,
    "B-NATIONALITY": 23,
    "B-OCCUPATION": 29,
    "B-PASSPORT": 42,
    "B-PASSPORTDATE": 43,
    "B-PHOTOATTACHMENT": 25,
    "B-RECORDID": 1,
    "B-RELATEDPERSONADDRESS": 39,
    "B-RELATEDPERSONNAME": 35,
    "B-RELATION": 37,
    "B-RESIDENTIALSTATUS": 27,
    "B-ZIP": 19,
    "I-ACCOUNTTYPE": 32,
    "I-ADDRESS": 14,
    "I-ANNUALINCOME": 34,
    "I-CITY": 18,
    "I-CITYOFBIRTH": 22,
    "I-DOB": 12,
    "I-GENDER": 8,
    "I-GUARDIANNAME": 6,
    "I-LANDMARK": 16,
    "I-MARITALSTATUS": 10,
    "I-NAME": 4,
    "I-NATIONALITY": 24,
    "I-OCCUPATION": 30,
    "I-PASSPORTDATE": 44,
    "I-PHOTOATTACHMENT": 26,
    "I-RELATEDPERSONADDRESS": 40,
    "I-RELATEDPERSONNAME": 36,
    "I-RELATION": 38,
    "I-RESIDENTIALSTATUS": 28,
    "I-ZIP": 20,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 0,
  "use_cache": false,
  "vocab_size": 128100
}
